config.org
#+TITLE: Literate doom Emacs config

* Table of Contents :TOC:
- [[#headers][Headers]]
- [[#doom][Doom]]
  - [[#vterm-endless-compilation-fix][Vterm endless compilation fix]]
  - [[#natively-compile-on-doom-sync][Natively compile on doom sync]]
- [[#profiler][Profiler]]
- [[#emacs][Emacs]]
  - [[#personal-information][Personal information]]
  - [[#keybinds][Keybinds]]
  - [[#workspaces][Workspaces]]
  - [[#disable-menu-and-tool-bar][Disable menu and tool bar]]
  - [[#show-current-function-in-modeline][Show current function in modeline]]
  - [[#unpin-doom-themes][Unpin doom themes]]
  - [[#default-fallback-theme][Default fallback theme]]
  - [[#daynight-mode-switching-function-based-on-emacs-plus-patch][Day/Night mode switching function (based on emacs-plus patch)]]
  - [[#disable-solaire-mode-in-terminal][Disable solaire-mode in terminal]]
  - [[#set-font][Set font]]
  - [[#set-dashboard-image][Set dashboard image]]
  - [[#start-emacs-maximized][Start emacs maximized]]
  - [[#truncate-doom-dashboard][Truncate doom dashboard]]
  - [[#set-frame-title-and-icon][Set frame title and icon]]
  - [[#ace-window][Ace window]]
  - [[#modeline][Modeline]]
  - [[#always-make-windows-proportional-after-splitting][Always make windows proportional after splitting]]
  - [[#truncate-ellipsis][Truncate ellipsis]]
  - [[#uniquify][Uniquify]]
  - [[#emacsclient][Emacsclient]]
- [[#centaur-tabs][Centaur Tabs]]
  - [[#group-tabs-by-projectile-project][Group tabs by projectile project]]
  - [[#show-tab-index-and-count][Show tab index and count]]
  - [[#disable-tabs-for-specific-buffers][Disable tabs for specific buffers]]
  - [[#gray-out-non-focused-buffer-icons][Gray out non focused buffer icons]]
- [[#editor][Editor]]
  - [[#enable-autosave][Enable autosave]]
  - [[#auto-backup-files][Auto backup files]]
  - [[#set-default-tab-width][Set default tab-width]]
  - [[#relative-numbers][Relative numbers]]
  - [[#set-scroll-margin][Set scroll margin]]
  - [[#disable-final-newline-in-files][Disable final newline in files]]
- [[#evil][Evil]]
  - [[#set-up-evil-packages][Set up evil packages]]
  - [[#fine-undo][Fine Undo]]
  - [[#split-windows-so-that-rightdown-is-focused-after-the-split][Split windows so that right/down is focused after the split]]
  - [[#line-up-y-behavior-to-other-operators][Line up Y behavior to other operators]]
  - [[#dont-continue-comments-on-oo-creating-empty-lines][Don't continue comments on o/O, creating empty lines]]
  - [[#changed-text-doesnt-go-into-clipboard][Changed text doesn't go into clipboard]]
  - [[#visual-mode-changes-dont-go-into-clipboard][Visual mode changes don't go into clipboard]]
  - [[#disable-escape-on-jk][Disable escape on "jk"]]
  - [[#evil-window-map][Evil Window Map]]
  - [[#enable-key-chord-and-make-double-tap--move-cursor-to-the-right-in-insert-mode][Enable key-chord and make double tap ';' move cursor to the right in insert mode]]
  - [[#disable-evil-keybindings-for-git-timemachine][Disable evil keybindings for git-timemachine]]
- [[#org-mode][Org mode]]
  - [[#update-dynamic-blocks-on-save][Update dynamic blocks on save]]
  - [[#org-mode-map][Org-mode-map]]
  - [[#set-visual-line-movement-via-gj-and-gk][Set visual line movement via gj and gk]]
  - [[#set-up-path-for-org-mode][Set up path for org mode]]
  - [[#exclude-certain-tags-from-inheritance][Exclude certain tags from inheritance]]
  - [[#set-up-headline-encryption][Set up headline encryption]]
  - [[#disable-electric-indent][Disable electric indent]]
  - [[#org-kanban][Org kanban]]
  - [[#org-appear][Org appear]]
  - [[#inline-images][Inline images]]
  - [[#log-time-of-done-tasks][Log time of done tasks]]
  - [[#task-status-and-prioritization][Task status and prioritization]]
  - [[#drawer-for-state-changes][Drawer for state changes]]
  - [[#headlines][Headlines]]
  - [[#bullet-points][Bullet points]]
  - [[#fancy-priorities][Fancy priorities]]
  - [[#move-tags-to-the-far-right][Move tags to the far right]]
  - [[#enable-word-wrap][Enable word-wrap]]
  - [[#visual-line-mode][Visual line mode]]
  - [[#emphasis-markers][Emphasis markers]]
  - [[#roam][Roam]]
  - [[#record-last-modified-date-in-org-mode][Record last modified date in org-mode]]
  - [[#org-capture-templates][Org capture templates]]
  - [[#org-capture-anywhere-macos][Org capture anywhere MacOS]]
  - [[#org-autolist][Org autolist]]
  - [[#disable-company-for-org-mode][Disable company for org-mode]]
- [[#treemacs][Treemacs]]
  - [[#treemacs-git-mode][Treemacs git mode]]
  - [[#treemacs-modes][Treemacs modes]]
  - [[#pull-all-the-icons-for-treemacs][Pull all the icons for treemacs]]
  - [[#set-treemacs-themes][Set treemacs themes]]
- [[#corfu][Corfu]]
  - [[#tng-keymap][TNG keymap]]
  - [[#global-corfu-mode][Global corfu mode]]
  - [[#remove-company-remnants][Remove company remnants]]
- [[#vterm][Vterm]]
  - [[#always-compile-without-confirmation][Always compile without confirmation]]
  - [[#increase-scrollback-for-vterm][Increase scrollback for vterm]]
  - [[#vterm-keybindings][Vterm keybindings]]
  - [[#show-modeline-in-vterm][Show modeline in vterm]]
- [[#flyspell][Flyspell]]
- [[#cheatsh][Cheat.sh]]
- [[#inheritenv][Inheritenv]]
- [[#dired][Dired]]
- [[#ox-confluence][ox-confluence]]
- [[#additional-config][Additional config]]
  - [[#load-wsl-config-override][Load WSL config override]]
  - [[#additional-tweaks-to-personal-info-and-org-mode-for-my-work][Additional tweaks to personal info and org mode for my work]]

* Headers
#+begin_src emacs-lisp :tangle init.el
;;; init.el -*- lexical-binding: t; -*-
#+end_src

#+begin_src emacs-lisp :tangle config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src

#+begin_src emacs-lisp :tangle packages.el
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
#+end_src

* Doom
#+begin_src emacs-lisp :tangle init.el
(doom! :completion
       ;; (company +childframe +tng)
       (vertico +icons)

       :local
       (corfu +icons +tng)

       :ui
       doom                                     ; what makes DOOM look the way it does
       doom-dashboard                           ; a nifty splash screen for Emacs
       doom-quit                                ; DOOM quit-message prompts when you quit Emacs
       (emoji +ascii +github +unicode)
       hl-todo
       indent-guides                            ; highlighted indent columns
       modeline                                 ; snazzy, Atom-inspired modeline, plus API
       nav-flash
       ophints                                  ; highlight the region an operation acts on
       (popup +defaults +all)                   ; tame sudden yet inevitable temporary windows
       tabs
       (treemacs +lsp)                          ; a project drawer, like neotree but cooler
       unicode                                  ; extended unicode support for various languages
       (window-select +numbers)                 ; visually switch windows
       workspaces                               ; tab emulation, persistence & separate workspaces
       (vc-gutter +diff-hl +pretty)             ; vcs diff in the fringe
       vi-tilde-fringe                          ; fringe tildes to mark beyond EOB
       zen

       :editor
       (evil +everywhere)                       ; come to the dark side, we have cookies
       file-templates                           ; auto-snippets for empty files
       fold                                     ; (nigh) universal code folding
       (format +onsave)                         ; automated prettiness
       rotate-text
       snippets                                 ; my elves. They type so I don't have to
       word-wrap

       :emacs
       (dired +icons +ranger)                   ; making dired pretty [functional] directory editor
       electric                                 ; smarter, keyword-based electric-indent
       (ibuffer +icons)                         ; interactive buffer management
       (undo +tree)                             ; persistent, smarter undo for your inevitable mistakes
       vc                                       ; version-control and Emacs, sitting in a tree

       :term
       vterm                                    ; the best terminal emulation in Emacs

       :checkers
       (spell +flyspell +everywhere)
       (syntax +childframe)                     ; tasing you for every semicolon you forget

       :tools
       ansible
                                                ;; (debugger +lsp)
       direnv
       (docker +lsp)
       editorconfig
       (eval +overlay)                          ; run code, run (also, repls)
       lookup                                   ; navigate your code and its documentation
       (lsp +eglot)                             ; M-x vscode
       (magit +forge)                           ; a git porcelain for Emacs
       pdf                                      ; pdf enhancements
       terraform                                ; infrastructure as code
       tree-sitter
       upload                                   ; map local to remote projects via ssh/ftp

       :os
       (:if IS-MAC macos)                       ; improve compatibility with macOS
       (tty +osc)                               ; improve the terminal Emacs experience

       :lang
       data
       emacs-lisp                               ; drown in parentheses
       graphql
       (go +lsp)
       (javascript +lsp +tree-sitter)
       (json +lsp +tree-sitter)                 ; At least it ain't XML
       (python +lsp +pyright +pyenv)            ; beautiful is better than ugly
       (nix +lsp)
       (org +pretty +present +dragndrop +roam2) ; organize your plain life in plain text
       rest
       (sh +lsp +fish +powershell)              ; she sells {ba,z,fi}sh shells on the C xor
       (web +lsp +tree-sitter)
       (yaml +lsp)                              ; JSON, but readable

       :app
       calendar

       :config
       (default +bindings +smartparens)
       literate)
#+end_src

** Vterm endless compilation fix
#+begin_src emacs-lisp :tangle init.el
(after! comp
  (mapc (doom-partial #'add-to-list 'native-comp-deferred-compilation-deny-list)
        (list "/emacs-jupyter.*\\.el\\'"
              "/evil-collection-vterm\\.el\\'"
              "/vterm\\.el\\'"
              "/with-editor\\.el\\'")))
#+end_src

** Natively compile on doom sync
#+begin_src emacs-lisp :tangle init.el
(setq native-comp-deferred-compilation nil)
(after! (doom-packages straight)
  (setq straight--native-comp-available t))
#+end_src

* Profiler
#+begin_src emacs-lisp :tangle config.el
;; (require 'profiler)
;; (profiler-start 'cpu)
#+end_src

* Emacs
** Personal information
#+begin_src emacs-lisp :tangle config.el
(setq  user-full-name "Sebastian Zawadzki"
       user-mail-address (rot13 "fronfgvna@mnjnqmxv.grpu"))
#+end_src

** Keybinds
*** Mac specific keybindings
#+begin_src emacs-lisp :tangle config.el
(cond (IS-MAC
       (setq mac-command-modifier       'meta
             mac-option-modifier        'alt)))
#+end_src

*** Mac style keyboard shortcuts
#+begin_src emacs-lisp :tangle config.el
(map! "M-c" #'kill-ring-save)
(map! "M-v" #'yank)
(map! "M-q" #'save-buffers-kill-terminal)
(map! "M-m" #'suspend-frame)
(map! "M-w" #'kill-this-buffer)
#+end_src

#+RESULTS:

*** Remove word backwards
#+begin_src emacs-lisp :tangle config.el
(map! "A-<backspace>" #'doom/delete-backward-word)
#+end_src

** Workspaces
#+begin_src emacs-lisp :tangle config.el
 (setq +workspaces-on-switch-project-behavior 'non-empty)
#+end_src

** Disable menu and tool bar
#+begin_src emacs-lisp :tangle config.el
(add-hook! 'doom-first-buffer-hook
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1))
#+end_src

** Show current function in modeline
#+begin_src emacs-lisp :tangle config.el
(which-function-mode)
#+end_src

** Unpin doom themes
#+begin_src emacs-lisp :tangle packages.el
(unpin! doom-themes)
#+end_src

** Default fallback theme
#+begin_src emacs-lisp :tangle config.el
(setq doom-theme 'doom-solarized-light)
#+end_src

** Day/Night mode switching function (based on emacs-plus patch)
#+begin_src emacs-lisp :tangle config.el
(defun my/apply-theme (appearance)
  (mapc #'disable-theme custom-enabled-themes)
  (pcase appearance
    ('light (setq doom-theme 'doom-solarized-light)
             (load-theme 'doom-solarized-light t))
    ('dark (setq doom-theme 'doom-solarized-dark)
             (load-theme 'doom-solarized-dark t)))
  (centaur-tabs-init-tabsets-store)
  (org-roam-ui-sync-theme))

(add-hook 'ns-system-appearance-change-functions #'my/apply-theme)
#+end_src

** Disable solaire-mode in terminal
#+begin_src emacs-lisp :tangle config.el
(unless (display-graphic-p)
  (solaire-global-mode -1))
#+end_src

** Set font
#+begin_src emacs-lisp :tangle config.el
(setq doom-font (font-spec :family "JetBrains Mono NL" :size 13)
      doom-big-font (font-spec :family "JetBrains Mono NL" :size 26)
      doom-variable-pitch-font (font-spec :family "Overpass" :size 13)
      doom-unicode-font (font-spec :family "JuliaMono")
      doom-serif-font (font-spec :family "IBM Plex Mono" :weight 'light))
#+end_src

*** Treemacs
#+begin_src emacs-lisp :tangle config.el
(setq doom-themes-treemacs-enable-variable-pitch nil)
#+end_src

** Set dashboard image
#+begin_src emacs-lisp :tangle config.el
(setq fancy-splash-image "~/.config/doom/banner.png")
#+end_src

** Start emacs maximized
#+begin_src emacs-lisp :tangle config.el
(setq initial-frame-alist '((fullscreen . maximized)))
#+end_src

** Truncate doom dashboard
#+begin_src emacs-lisp :tangle config.el
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-footer)
#+end_src

** Set frame title and icon
#+begin_src emacs-lisp :tangle config.el
(setq-default
 frame-title-format '("Doom")
 ns-use-proxy-icon nil)
#+end_src

** Ace window

