config.org
*** Unpin ace window
#+begin_src emacs-lisp :tangle packages.el
(package! ace-window :pin "77115afc1b0b9f633084cf7479c767988106c196")
#+end_src

*** Make window indicator more visible
#+begin_src emacs-lisp :tangle config.el
(custom-set-faces!
  '(aw-leading-char-face
    :foreground "red"
    :weight bold
    :height 2.5))
(ace-window-posframe-mode 1)
#+end_src

*** Set aw keys to homerow
#+begin_src emacs-lisp :tangle config.el
(setq aw-keys '(?a ?o ?e ?u ?h ?t ?n ?s))
#+end_src


** Modeline
#+begin_src emacs-lisp :tangle config.el
(setq doom-modeline-icon (display-graphic-p)
      doom-modeline-major-mode-icon nil
      doom-modeline-buffer-state-icon t)
#+end_src

** Always make windows proportional after splitting
#+begin_src emacs-lisp :tangle config.el
(setq-default window-combination-resize t)
#+end_src

** Truncate ellipsis
#+begin_src emacs-lisp :tangle config.el
(setq-default truncate-string-ellipsis "…")
#+end_src

** Uniquify
#+begin_src emacs-lisp :tangle config.el
(require 'uniquify)
(setq uniquify-buffer-name-style 'forward)
(setq uniquify-separator "/")
(setq uniquify-after-kill-buffer-p t)    ; rename after killing uniquified
(setq uniquify-ignore-buffers-re "^\\*") ; don't muck with special buffers;       uniquify-ignore-buffers-re "^\\*")
(after! persp-mode
  (setq-hook! 'persp-mode-hook uniquify-buffer-name-style 'forward))
#+end_src

** Emacsclient
#+begin_src emacs-lisp :tangle config.el
(after! persp-mode
  (setq persp-emacsclient-init-frame-behaviour-override "main"))
#+end_src

* Centaur Tabs
** Group tabs by projectile project
#+begin_src emacs-lisp :tangle config.el
(require 'centaur-tabs)
(centaur-tabs-group-by-projectile-project)
#+end_src

** Show tab index and count
#+begin_src emacs-lisp :tangle config.el
(setq centaur-tabs-show-count t)
#+end_src

** Disable tabs for specific buffers
#+begin_src emacs-lisp :tangle config.el
(add-hook 'ibuffer-mode-hook 'centaur-tabs-local-mode)
(add-hook 'org-agenda-mode-hook 'centaur-tabs-local-mode)
#+end_src

** Gray out non focused buffer icons
#+begin_src emacs-lisp :tangle config.el
(setq centaur-tabs-gray-out-icons 'buffer)
#+end_src


* Editor
** Enable autosave
#+begin_src emacs-lisp :tangle config.el
(setq auto-save-default t)
#+end_src

** Auto backup files
#+begin_src emacs-lisp :tangle config.el
(setq make-backup-files t)
#+end_src

** Set default tab-width
#+begin_src emacs-lisp :tangle config.el
(setq-default tab-width 4)
#+end_src

** Relative numbers
#+begin_src emacs-lisp :tangle config.el
(setq display-line-numbers-type 'visual)
#+end_src

** Set scroll margin
#+begin_src emacs-lisp :tangle config.el
(setq scroll-margin 5)
#+end_src

** Disable final newline in files
#+begin_src emacs-lisp :tangle config.el
(setq require-final-newline nil)
#+end_src

* Evil
** Set up evil packages
#+begin_src emacs-lisp :tangle packages.el
(package! evil-commentary)
(package! evil-snipe :disable t)
#+end_src

** Fine Undo
#+begin_src emacs-lisp :tangle config.el
(setq evil-want-fine-undo t)
#+end_src

** Split windows so that right/down is focused after the split
#+begin_src emacs-lisp :tangle config.el
(setq evil-vsplit-window-right t
      evil-split-window-below t)
#+end_src

** Line up Y behavior to other operators
#+begin_src emacs-lisp :tangle config.el
(setq evil-want-Y-yank-to-eol t)
#+end_src

** Don't continue comments on o/O, creating empty lines
#+begin_src emacs-lisp :tangle config.el
(setq +evil-want-o/O-to-continue-comments nil)
#+end_src

** Changed text doesn't go into clipboard
#+begin_src emacs-lisp :tangle config.el
(defun schrenker/evil-change (orig-fn beg end &optional type _ &rest args)
    (apply orig-fn beg end type ?_ args))
(advice-add 'evil-change :around 'schrenker/evil-change)
#+end_src

** Visual mode changes don't go into clipboard
#+begin_src emacs-lisp :tangle config.el
(setq evil-kill-on-visual-paste nil)
#+end_src

** Disable escape on "jk"
#+begin_src emacs-lisp :tangle config.el
(setq evil-escape-key-sequence nil)
#+end_src

** Evil Window Map
#+begin_src emacs-lisp :tangle config.el
(map! :map evil-window-map
      :g "w" #'ace-window
      :g "p" #'treemacs-select-window)
#+end_src

** Enable key-chord and make double tap ';' move cursor to the right in insert mode
#+begin_src emacs-lisp :tangle packages.el
(package! key-chord)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(require 'key-chord)

(key-chord-define evil-insert-state-map ";;" 'right-char)
(key-chord-mode 1)
#+end_src

** Disable evil keybindings for git-timemachine
#+begin_src emacs-lisp :tangle config.el
(with-eval-after-load 'git-timemachine
  (evil-make-overriding-map git-timemachine-mode-map 'normal)
  (add-hook 'git-timemachine-mode-hook #'evil-normalize-keymaps))
#+end_src

* Org mode
#+begin_src emacs-lisp :tangle config.el
(setq org-startup-folded 'nofold)
#+end_src

** Update dynamic blocks on save
 #+begin_src emacs-lisp :tangle config.el
 (after! org
   (add-hook 'before-save-hook 'org-update-all-dblocks))
 #+end_src

** Org-mode-map
#+begin_src emacs-lisp :tangle config.el
(map! :map org-mode-map
      :localleader "$" #'org-decrypt-entry
      :localleader "a i" #'org-display-inline-images)
#+end_src


** Set visual line movement via gj and gk
#+begin_src emacs-lisp :tangle config.el
(after! org
  (map! :map org-mode-map
        :nv "gj" #'evil-next-visual-line
        :nv "gk" #'evil-previous-visual-line))
#+end_src

** Set up path for org mode
#+begin_src emacs-lisp :tangle config.el
(setq org-directory "/Users/sebastian/Library/Mobile Documents/iCloud~com~appsonthemove~beorg/Documents/brain"
      org-roam-directory org-directory
      org-archive-location "archive/%s_archive::"
      org-default-notes-file (concat org-directory "/20221222131538-personal.org")
      +org-capture-notes-file org-default-notes-file)
#+end_src

** Exclude certain tags from inheritance
#+begin_src emacs-lisp :tangle config.el
(setq org-tags-exclude-from-inheritance '("crypt"
                                          "moc"
                                          "inbox"))
#+end_src


** Set up headline encryption
#+begin_src emacs-lisp :tangle config.el
(require 'org-crypt)

(setq org-crypt-disable-auto-save t
      org-crypt-key (rot13 "fronfgvna@mnjnqmxv.grpu"))
#+end_src

** Disable electric indent
#+begin_src emacs-lisp :tangle config.el
(add-hook! org-mode (electric-indent-local-mode -1))
#+end_src

** Org kanban
#+begin_src emacs-lisp :tangle packages.el
(package! org-kanban)
#+end_src

** Org appear
#+begin_src emacs-lisp :tangle packages.el
(package! org-appear :recipe (:host github :repo "awth13/org-appear"))
#+end_src

#+begin_src emacs-lisp :tangle config.el
(add-hook 'org-mode-hook 'org-appear-mode)
#+end_src

** Inline images
#+begin_src emacs-lisp :tangle config.el
(setq org-display-remote-inline-images t
      org-startup-with-inline-images t
      org-image-actual-width nil)
#+end_src

** Log time of done tasks
#+begin_src emacs-lisp :tangle config.el
(setq org-log-done 'time)
#+end_src


** Task status and prioritization
#+begin_src emacs-lisp :tangle config.el
(after! org
  (setq
   org-crypt-disable-auto-save t
   org-priority-highest '?A
   org-priority-lowest  '?C
   org-priority-default '?C
   org-priority-start-cycle-with-default t
   org-priority-faces '((?A :foreground "#FF6C6B" :weight normal)
                        (?B :foreground "#ECBE7B" :weight normal)
                        (?C :foreground "#51AFEF" :weight normal))
   org-todo-keywords '((sequence "TODO(t)" "INPROGRESS(i!)" "BLOCKED(b@/!)" "ONHOLD(o@/!)" "REVIEW(r!)" "|" "DONE(d/@)" "DELEGATED(e@/@)" "CANCELLED(c@/@)"))
   org-todo-keyword-faces
   '(("TODO" :foreground "#8741bb" :weight bold :inverse-video t)
     ("INPROGRESS" :foreground "#98BE65" :weight bold :inverse-video t)
     ("BLOCKED" :foreground "#DA8548" :weight bold :inverse-video t)
     ("ONHOLD" :foreground "#2AA198" :weight bold :inverse-video t)
     ("REVIEW" :foreground "#00BFFF" :weight bold :inverse-video t)
     ("DONE" :foreground "#9FA4BB" :weight bold :inverse-video t )
     ("CANCELLED" :foreground "#574C58" :weight bold :inverse-video t)
     ("DELEGATED"  :foreground "#6c71c4" :weight bold :inverse-video t))))

#+end_src

** Drawer for state changes
#+begin_src emacs-lisp :tangle config.el
(setq org-log-into-drawer "LOGBOOK"
      org-log-state-notes-into-drawer "LOGBOOK")
#+end_src

** Headlines
#+begin_src emacs-lisp :tangle config.el
(setq org-superstar-headline-bullets-list '("⁖"))

(after! org
  (custom-set-faces!
    '(org-level-1 :height 1.04 :inherit outline-1)
    '(org-level-2 :height 1.04 :inherit outline-2)
    '(org-level-3 :height 1.04 :inherit outline-3)
    '(org-level-4 :height 1.04 :inherit outline-4)
    '(org-level-5 :height 1.04 :inherit outline-5)
    '(org-level-6 :height 1.04 :inherit outline-6)
    '(org-level-7 :height 1.04 :inherit outline-7)
    '(org-level-8 :height 1.04 :inherit outline-8)))
#+end_src

** Bullet points
#+begin_src emacs-lisp :tangle config.el
(setq org-superstar-prettify-item-bullets nil)

(font-lock-add-keywords 'org-mode
                        '(("^ *\\([-]\\) "
                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "◆"))))))
(font-lock-add-keywords 'org-mode
                        '(("^ *\\([+]\\) "
                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "◇"))))))
#+end_src

** Fancy priorities
#+begin_src emacs-lisp :tangle config.el
(after! org-fancy-priorities
  (setq
   org-fancy-priorities-list '((65 . "⁂")
                               (66 . "⁑")
                               (67 . "⁕"))))
#+end_src

** Move tags to the far right
#+begin_src emacs-lisp :tangle config.el
(after! org
  (setq org-tags-column -77))
#+end_src

** Enable word-wrap
#+begin_src emacs-lisp :tangle config.el
(add-hook 'org-mode-hook #'+word-wrap-mode)
#+end_src

** Visual line mode
#+begin_src emacs-lisp :tangle config.el
(add-hook 'org-mode-hook #'visual-line-mode)
#+end_src

** Emphasis markers
#+begin_src emacs-lisp :tangle config.el
(setq org-hide-emphasis-markers t)
#+end_src

** Roam

