config.el
  '(aw-leading-char-face
    :foreground "red"
    :weight bold
    :height 2.5))
(ace-window-posframe-mode 1)

(setq aw-keys '(?a ?o ?e ?u ?h ?t ?n ?s))

(setq doom-modeline-icon (display-graphic-p)
      doom-modeline-major-mode-icon nil
      doom-modeline-buffer-state-icon t)

(setq-default window-combination-resize t)

(setq-default truncate-string-ellipsis "…")

(require 'uniquify)
(setq uniquify-buffer-name-style 'forward)
(setq uniquify-separator "/")
(setq uniquify-after-kill-buffer-p t)    ; rename after killing uniquified
(setq uniquify-ignore-buffers-re "^\\*") ; don't muck with special buffers;       uniquify-ignore-buffers-re "^\\*")
(after! persp-mode
  (setq-hook! 'persp-mode-hook uniquify-buffer-name-style 'forward))

(after! persp-mode
  (setq persp-emacsclient-init-frame-behaviour-override "main"))

(require 'centaur-tabs)
(centaur-tabs-group-by-projectile-project)

(setq centaur-tabs-show-count t)

(add-hook 'ibuffer-mode-hook 'centaur-tabs-local-mode)
(add-hook 'org-agenda-mode-hook 'centaur-tabs-local-mode)

(setq centaur-tabs-gray-out-icons 'buffer)

(setq auto-save-default t)

(setq make-backup-files t)

(setq-default tab-width 4)

(setq display-line-numbers-type 'visual)

(setq scroll-margin 5)

(setq require-final-newline nil)

(setq evil-want-fine-undo t)

(setq evil-vsplit-window-right t
      evil-split-window-below t)

(setq evil-want-Y-yank-to-eol t)

(setq +evil-want-o/O-to-continue-comments nil)

(defun schrenker/evil-change (orig-fn beg end &optional type _ &rest args)
    (apply orig-fn beg end type ?_ args))
(advice-add 'evil-change :around 'schrenker/evil-change)

(setq evil-kill-on-visual-paste nil)

(setq evil-escape-key-sequence nil)

(map! :map evil-window-map
      :g "w" #'ace-window
      :g "p" #'treemacs-select-window)

(require 'key-chord)

(key-chord-define evil-insert-state-map ";;" 'right-char)
(key-chord-mode 1)

(with-eval-after-load 'git-timemachine
  (evil-make-overriding-map git-timemachine-mode-map 'normal)
  (add-hook 'git-timemachine-mode-hook #'evil-normalize-keymaps))

(setq org-startup-folded 'nofold)

(after! org
  (add-hook 'before-save-hook 'org-update-all-dblocks))

(map! :map org-mode-map
      :localleader "$" #'org-decrypt-entry
      :localleader "a i" #'org-display-inline-images)

(after! org
  (map! :map org-mode-map
        :nv "gj" #'evil-next-visual-line
        :nv "gk" #'evil-previous-visual-line))

(setq org-directory "/Users/sebastian/Library/Mobile Documents/com~apple~CloudDocs/brain"
      org-roam-directory org-directory
      org-archive-location "archive/%s_archive::"
      org-default-notes-file (concat org-directory "/20221222131538-personal.org")
      +org-capture-notes-file org-default-notes-file)

(setq org-tags-exclude-from-inheritance '("crypt"
                                          "moc"
                                          "inbox"))

(require 'org-crypt)

(setq org-crypt-disable-auto-save t
      org-crypt-key (rot13 "fronfgvna@mnjnqmxv.grpu"))

(add-hook! org-mode (electric-indent-local-mode -1))

(add-hook 'org-mode-hook 'org-appear-mode)

(setq org-display-remote-inline-images t
      org-startup-with-inline-images t
      org-image-actual-width nil)

(setq org-log-done 'time)

(after! org
  (setq
   org-crypt-disable-auto-save t
   org-priority-highest '?A
   org-priority-lowest  '?C
   org-priority-default '?C
   org-priority-start-cycle-with-default t
   org-priority-faces '((?A :foreground "#FF6C6B" :weight normal)
                        (?B :foreground "#ECBE7B" :weight normal)
                        (?C :foreground "#51AFEF" :weight normal))
   org-todo-keywords '((sequence "TODO(t)" "INPROGRESS(i)" "BLOCKED(b)" "ONHOLD(o)" "REVIEW(r)" "|" "DONE(d)" "DELEGATED(e)" "CANCELLED(c)"))
   org-todo-keyword-faces
   '(("TODO" :foreground "#8741bb" :weight bold :inverse-video t)
     ("INPROGRESS" :foreground "#98BE65" :weight bold :inverse-video t)
     ("BLOCKED" :foreground "#DA8548" :weight bold :inverse-video t)
     ("ONHOLD" :foreground "#2AA198" :weight bold :inverse-video t)
     ("REVIEW" :foreground "#00BFFF" :weight bold :inverse-video t)
     ("DONE" :foreground "#9FA4BB" :weight bold :inverse-video t )
     ("CANCELLED" :foreground "#574C58" :weight bold :inverse-video t)
     ("DELEGATED"  :foreground "#6c71c4" :weight bold :inverse-video t))))

(setq org-superstar-headline-bullets-list '("⁖"))

(after! org
  (custom-set-faces!
    '(org-level-1 :height 1.04 :inherit outline-1)
    '(org-level-2 :height 1.04 :inherit outline-2)
    '(org-level-3 :height 1.04 :inherit outline-3)
    '(org-level-4 :height 1.04 :inherit outline-4)
    '(org-level-5 :height 1.04 :inherit outline-5)
    '(org-level-6 :height 1.04 :inherit outline-6)
    '(org-level-7 :height 1.04 :inherit outline-7)
    '(org-level-8 :height 1.04 :inherit outline-8)))

(setq org-superstar-prettify-item-bullets nil)

(font-lock-add-keywords 'org-mode
                        '(("^ *\\([-]\\) "
                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "◆"))))))
(font-lock-add-keywords 'org-mode
                        '(("^ *\\([+]\\) "
                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "◇"))))))

;; (add-hook 'org-mode-hook (lambda ()
;;   (push '("[#A]" . "⁂" ) prettify-symbols-alist)
;;   (push '("[#B]" . "⁑" ) prettify-symbols-alist)
;;   (push '("[#C]" . "⁕" ) prettify-symbols-alist)
;;   (prettify-symbols-mode)))

(after! org-fancy-priorities
  (setq
   org-fancy-priorities-list '((65 . "⁂")
                               (66 . "⁑")
                               (67 . "⁕"))))

(setq org-tags-column -77)

(add-hook 'org-mode-hook #'+word-wrap-mode)

(add-hook 'org-mode-hook #'visual-line-mode)

(setq org-hide-emphasis-markers t)
