config.org
*** Org roam keybinds
#+begin_src emacs-lisp :tangle config.el
(map! :map doom-leader-notes-map
      :g "r t" #'org-roam-ui-sync-theme
      :g "r o" #'org-roam-ui-open)
#+end_src

*** Org-roam-ui
#+begin_src emacs-lisp :tangle packages.el
(unpin! org-roam)
(package! org-roam-ui)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))
#+end_src

*** Default template
#+begin_src emacs-lisp :tangle config.el
(setq org-roam-capture-templates '(("d" "default" plain "%?"
                                      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+startup: showeverything\n#+date: %U\n#+modified: \n#+filetags: :inbox:\n\n")
                                      :immediate-finish t)))
#+end_src

** Record last modified date in org-mode
#+begin_src emacs-lisp :tangle config.el
(after! org
  (setq time-stamp-active t
    time-stamp-start "#\\+modified: [ \t]*"
    time-stamp-end "$"
    time-stamp-format "\[%Y-%02m-%02d %3a %02H:%02M\]")
(add-hook 'before-save-hook 'time-stamp))
#+end_src

** Org capture templates
#+begin_src emacs-lisp :tangle config.el
(after! org
  (setq org-capture-templates
        '(
          ("n" "Note" entry (file+headline org-default-notes-file "Notes")
           "** %U\n%i%?" :empty-lines 1)
          ("t" "Task" entry (file+headline org-default-notes-file "Tasks" "Backlog")
           "** TODO %?" :empty-lines 1)
          )))
#+end_src

** Org capture anywhere MacOS
#+begin_src emacs-lisp :tangle packages.el
(package! noflet)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(require 'noflet)
(defun schrenker/make-capture-frame ()
  "Create a new frame and run `org-capture'."
  (interactive)
  (make-frame '((name . "capture")
                (top . 300)
                (left . 700)
                (width . 80)
                (height . 25)))
  (select-frame-by-name "capture")
  (delete-other-windows)
  (noflet ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
          (org-capture)))

(defadvice org-capture-finalize
    (after delete-capture-frame activate)
  "Advise capture-finalize to close the frame."
  (if (equal "capture" (frame-parameter nil 'name))
      (delete-frame)))

(defadvice org-capture-destroy
    (after delete-capture-frame activate)
  "Advise capture-destroy to close the frame."
  (if (equal "capture" (frame-parameter nil 'name))
      (delete-frame)))
#+end_src

** Org autolist
#+begin_src emacs-lisp :tangle packages.el
(package! org-autolist)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(add-hook 'org-mode-hook (lambda () (org-autolist-mode)))
#+end_src

** Disable company for org-mode
#+begin_src emacs-lisp :tangle config.el
(setq company-global-modes '(not org-mode))
(add-hook 'org-mode-hook (lambda () ( company-mode -1)))
#+end_src

* Treemacs

** Treemacs git mode
#+begin_src emacs-lisp :tangle config.el
(setq +treemacs-git-mode 'deferred)
#+end_src

** Treemacs modes
#+begin_src emacs-lisp :tangle config.el
(setq treemacs-follow-mode t)
#+end_src

** Pull all the icons for treemacs
#+begin_src emacs-lisp :tangle packages.el
(package! treemacs-all-the-icons)
#+end_src

** Set treemacs themes
#+begin_src emacs-lisp :tangle config.el
(require 'treemacs-all-the-icons)
(treemacs-load-theme "all-the-icons")

(setq doom-themes-treemacs-theme "doom-colors")
#+end_src

* Corfu
#+begin_src emacs-lisp :tangle config.el
(setq corfu-preview-current 'insert
      corfu-preselect 'prompt ;; Disable candidate preselection
      corfu-excluded-modes
      '(erc-mode
        circe-mode
        help-mode
        gud-mode
        vterm-mode))
        ;; org-mode))
#+end_src

** TNG keymap
#+begin_src emacs-lisp :tangle config.el
    (map! ;;:desc "complete" "TAB" #'completion-at-point
     :map 'corfu-map
     :desc "next" "TAB" #'corfu-next
     :desc "next" "<tab>" #'corfu-next
     :desc "next" [tab] #'corfu-next
     :desc "previous" "S-TAB" #'corfu-previous
     :desc "previous" "<backtab>"  #'corfu-previous
     :desc "previous" [backtab] #'corfu-previous)
#+end_src

** Global corfu mode
#+begin_src emacs-lisp :tangle config.el
(global-corfu-mode)
#+end_src

** Remove company remnants
#+begin_src emacs-lisp :tangle config.el
(setq +lsp-company-backends nil
      +vertico-company-completion-styles nil)
#+end_src

* Vterm
** Always compile without confirmation
#+begin_src emacs-lisp :tangle config.el
(setq vterm-always-compile-module t)
#+end_src

** Increase scrollback for vterm
#+begin_src emacs-lisp :tangle config.el
(setq vterm-max-scrollback 100000)
      ;; vterm-buffer-name-string "VT: %s")
#+end_src

** Vterm keybindings
#+begin_src emacs-lisp :tangle config.el
(map! :after vterm
       :map vterm-mode-map
       :ni "<tab>" #'vterm-send-tab
       :nvi "M-v" #'evil-collection-vterm-paste-after
       :nvi "M-c" #'evil-yank
       :i   "A-<backspace>" '(lambda () (interactive) (vterm-send-key (kbd "C-w"))))
#+end_src

** Show modeline in vterm
#+begin_src emacs-lisp :tangle config.el
(remove-hook 'vterm-mode-hook #'hide-mode-line-mode)
#+end_src

* Flyspell
#+begin_src emacs-lisp :tangle config.el
(after! flyspell
  (setq flyspell-lazy-idle-seconds 2))
#+end_src

* Cheat.sh
#+begin_src emacs-lisp :tangle packages.el
(package! cheat-sh)
#+end_src

* Inheritenv
#+begin_src emacs-lisp :tangle packages.el
(package! inheritenv)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(require 'inheritenv)
(inheritenv-add-advice #'with-temp-buffer)
#+end_src

* Dired
#+begin_src emacs-lisp :tangle config.el
(map! :map dired-mode-map
      :n "h" #'dired-up-directory
      :n "l" #'dired-find-alternate-file)
#+end_src

* ox-confluence
#+begin_src emacs-lisp :tangle packages.el
(package! ox-confluence :recipe (:host github :repo "nan0scho1ar/ox-confluence-modern" :files ("*.el")))
#+end_src

* Additional config

** Load WSL config override
#+begin_src emacs-lisp :tangle config.el
(unless IS-MAC
  ;;Start emacs non-maximized
  (setq initial-frame-alist '((top . 1) (left . 1) (width . 120) (height . 40)))
  ;;Unset problematic keybinds
  (map! "M-m" nil))
#+end_src

** Additional tweaks to personal info and org mode for my work
#+begin_src emacs-lisp :tangle config.el
(load "~/.config/doom/work.el" t t)
#+end_src
