config.el

(map! :map doom-leader-notes-map
      :g "r t" #'org-roam-ui-sync-theme
      :g "r o" #'org-roam-ui-open)

(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))

(setq org-roam-capture-templates '(("d" "default" plain "%?"
                                      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+startup: showeverything\n#+date: %U\n#+modified: \n#+filetags: :inbox:\n\n")
                                      :immediate-finish t)))

(after! org
  (setq time-stamp-active t
    time-stamp-start "#\\+modified: [ \t]*"
    time-stamp-end "$"
    time-stamp-format "\[%Y-%02m-%02d %3a %02H:%02M\]")
(add-hook 'before-save-hook 'time-stamp))

(after! org
  (setq org-capture-templates
        '(
          ("n" "Note" entry (file+headline org-default-notes-file "Notes")
           "** %U\n%i%?" :empty-lines 1)
          ("t" "Task" entry (file+headline org-default-notes-file "Tasks" "Backlog")
           "** TODO %?" :empty-lines 1)
          )))

(require 'noflet)
(defun schrenker/make-capture-frame ()
  "Create a new frame and run `org-capture'."
  (interactive)
  (make-frame '((name . "capture")
                (top . 300)
                (left . 700)
                (width . 80)
                (height . 25)))
  (select-frame-by-name "capture")
  (delete-other-windows)
  (noflet ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
          (org-capture)))

(defadvice org-capture-finalize
    (after delete-capture-frame activate)
  "Advise capture-finalize to close the frame."
  (if (equal "capture" (frame-parameter nil 'name))
      (delete-frame)))

(defadvice org-capture-destroy
    (after delete-capture-frame activate)
  "Advise capture-destroy to close the frame."
  (if (equal "capture" (frame-parameter nil 'name))
      (delete-frame)))

(add-hook 'org-mode-hook (lambda () (org-autolist-mode)))

(setq company-global-modes '(not org-mode))
(add-hook 'org-mode-hook (lambda () ( company-mode -1)))

(setq +treemacs-git-mode 'deferred)

(setq treemacs-follow-mode t)

(require 'treemacs-all-the-icons)
(treemacs-load-theme "all-the-icons")

(setq doom-themes-treemacs-theme "doom-colors")

(setq corfu-preview-current 'insert
      corfu-preselect 'prompt ;; Disable candidate preselection
      corfu-excluded-modes
      '(erc-mode
        circe-mode
        help-mode
        gud-mode
        vterm-mode))
        ;; org-mode))

(map! ;;:desc "complete" "TAB" #'completion-at-point
 :map 'corfu-map
 :desc "next" "TAB" #'corfu-next
 :desc "next" "<tab>" #'corfu-next
 :desc "next" [tab] #'corfu-next
 :desc "previous" "S-TAB" #'corfu-previous
 :desc "previous" "<backtab>"  #'corfu-previous
 :desc "previous" [backtab] #'corfu-previous)

(global-corfu-mode)

(setq +lsp-company-backends nil
      +vertico-company-completion-styles nil)

(setq vterm-always-compile-module t)

(setq vterm-max-scrollback 100000)
      ;; vterm-buffer-name-string "VT: %s")

(map! :after vterm
       :map vterm-mode-map
       :ni "<tab>" #'vterm-send-tab
       :nvi "M-v" #'evil-collection-vterm-paste-after
       :nvi "M-c" #'evil-yank
       :i   "A-<backspace>" '(lambda () (interactive) (vterm-send-key (kbd "C-w"))))

(remove-hook 'vterm-mode-hook #'hide-mode-line-mode)

(after! flyspell
  (setq flyspell-lazy-idle-seconds 2))

(require 'inheritenv)
(inheritenv-add-advice #'with-temp-buffer)

(map! :map dired-mode-map
      :n "h" #'dired-up-directory
      :n "l" #'dired-find-alternate-file)

(unless IS-MAC
  ;;Start emacs non-maximized
  (setq initial-frame-alist '((top . 1) (left . 1) (width . 120) (height . 40)))
  ;;Unset problematic keybinds
  (map! "M-m" nil))

(load "~/.config/doom/work.el" t t)
